{
  "projects": [
    {
      "slug": "b2b-platform-ia",
      "title": {
        "de": "Informationsarchitektur für eine kollaborative B2B-Plattform",
        "en": "Information Architecture for a Collaborative B2B Platform"
      },
      "year": "2023",
      "duration": { "de": "3 Monate", "en": "3 months" },
      "role": {
        "de": "UX Research · Information Architecture · Facilitation",
        "en": "UX Research · Information Architecture · Facilitation"
      },
      "client": {
        "de": "B2B-Plattform (vertraulich)",
        "en": "B2B Platform (confidential)"
      },
      "tags": ["UX Research", "Information Architecture", "Facilitation"],
      "confidential": true,
      "teaser": {
        "de": "Strukturierung einer komplexen Produktwelt für eine genossenschaftlich organisierte B2B-Plattform – mit 6 Workshops, 20+ Teilnehmern aus 12 Unternehmen und einem abschließenden Treetest.",
        "en": "Structuring a complex product world for a cooperatively organised B2B platform – with 6 workshops, 20+ participants from 12 companies and a concluding tree test."
      },
      "sections": [
        {
          "type": "stat_bar",
          "stats": [
            { "value": "6",   "label": { "de": "Workshops",          "en": "Workshops" } },
            { "value": "20+", "label": { "de": "Teilnehmer",         "en": "Participants" } },
            { "value": "12",  "label": { "de": "Partnerunternehmen", "en": "Partner Companies" } },
            { "value": "20",  "label": { "de": "Treetest-Probanden", "en": "Tree Test Participants" } }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Eine abonnierbare Plattform für Distributoren und ihre Herstellerpartner – genossenschaftlich organisiert, mit vielen gleichberechtigten Stimmen. Die Herausforderung bestand nicht nur darin, eine komplexe Produktwelt auf Makro- und Mikroebene zu strukturieren, sondern dabei Stakeholder mit teils gegensätzlichen Vorstellungen zu einem gemeinsamen Ergebnis zu führen.",
            "en": "A subscription platform for distributors and their manufacturer partners – cooperatively organised, with many equal voices. The challenge was not only to structure a complex product world at macro and micro level, but to guide stakeholders with partly opposing visions towards a shared outcome."
          }
        },
        {
          "type": "timeline",
          "phases": [
            {
              "phase": "01",
              "title": { "de": "Vorbereitung", "en": "Preparation" },
              "description": { "de": "Problemraum verstehen, Stakeholder-Mapping, Workshop-Design", "en": "Understanding the problem space, stakeholder mapping, workshop design" }
            },
            {
              "phase": "02",
              "title": { "de": "Buchdeckel-Workshops", "en": "Book Cover Workshops" },
              "description": { "de": "6 Sessions mit über 20 Teilnehmern aus einem Dutzend Unternehmen. Produktwelt auf Makro- und Mikroebene clustern, Informationen hierarchisch priorisieren.", "en": "6 sessions with over 20 participants from a dozen companies. Clustering the product world at macro and micro level, prioritising information hierarchically." }
            },
            {
              "phase": "03",
              "title": { "de": "Synthese", "en": "Synthesis" },
              "description": { "de": "Workshopergebnisse konsolidieren, Informationsarchitektur, Navigationsstruktur und Seitenstruktur ableiten.", "en": "Consolidating workshop results, deriving information architecture, navigation structure and page structure." }
            },
            {
              "phase": "04",
              "title": { "de": "Treetest", "en": "Tree Test" },
              "description": { "de": "Gemeinsam mit Stakeholdern Szenarien und Aufgaben entwickeln. 20 Probanden testen die Struktur auf Findbarkeit und Nachvollziehbarkeit.", "en": "Developing scenarios and tasks together with stakeholders. 20 participants testing the structure for findability and comprehensibility." }
            },
            {
              "phase": "05",
              "title": { "de": "Validierung & Übergabe", "en": "Validation & Handover" },
              "description": { "de": "Ergebnisse auswerten, Implikationen auf die Architektur ableiten, Stakeholdern präsentieren, Struktur finalisieren.", "en": "Evaluating results, deriving implications for the architecture, presenting to stakeholders, finalising structure." }
            }
          ]
        },
        {
          "type": "method_grid",
          "methods": [
            {
              "icon": "cards",
              "title": { "de": "Card Sorting", "en": "Card Sorting" },
              "description": { "de": "Inhalte und Produkte durch die Augen der Nutzer gruppieren – ohne vorgegebene Kategorien.", "en": "Grouping content and products through the eyes of users – without predefined categories." }
            },
            {
              "icon": "layers",
              "title": { "de": "Buchdeckel-Methode", "en": "Book Cover Method" },
              "description": { "de": "Buchrücken = Eyecatcher. Titelblatt = unverzichtbare Essenz. Rückseite = Überblick. Prioritäten greifbar machen, ohne abstrakt zu bleiben.", "en": "Spine = eye-catcher. Cover = indispensable essence. Back cover = overview. Making priorities tangible without remaining abstract." }
            },
            {
              "icon": "tree",
              "title": { "de": "Treetest", "en": "Tree Test" },
              "description": { "de": "Die fertige Struktur auf mentale Modelle testen – findest du, was du suchst, und wo erwartest du es?", "en": "Testing the finished structure against mental models – can you find what you are looking for, and where do you expect it?" }
            },
            {
              "icon": "network",
              "title": { "de": "Stakeholder Facilitation", "en": "Stakeholder Facilitation" },
              "description": { "de": "Divergente Perspektiven aus einem Dutzend Unternehmen in einen gemeinsamen Prozess führen – und am Ende zu einem Ergebnis, das alle tragen.", "en": "Guiding divergent perspectives from a dozen companies into a shared process – and ultimately to an outcome that everyone can stand behind." }
            }
          ]
        },
        {
          "type": "insight",
          "content": {
            "de": "„Der Treetest offenbarte mentale Modelle, die kein Stakeholder antizipiert hatte – und machte Anpassungen notwendig, die die Struktur am Ende deutlich robuster machten.\"",
            "en": "\"The tree test revealed mental models that no stakeholder had anticipated – and necessitated adjustments that ultimately made the structure significantly more robust.\""
          }
        },
        {
          "type": "challenge_approach_outcome",
          "outcome": {
            "de": "Eine Informationsarchitektur, Navigationsstruktur und Seitenstruktur, die Stakeholder und Nutzer gleichermaßen überzeugten. Und ein Prozess, in dem alle Beteiligten das Gefühl hatten, gehört worden zu sein – was in einem genossenschaftlichen Kontext keine Selbstverständlichkeit ist.",
            "en": "An information architecture, navigation structure and page structure that convinced stakeholders and users alike. And a process in which all participants felt heard – which is by no means a given in a cooperative context."
          }
        }
      ],
      "assets": []
    }
  ,
    {
      "slug": "evidoxa",
      "title": {
        "de": "Evidoxa — Forschungsdatenmanagement für Geisteswissenschaftler:innen",
        "en": "Evidoxa — Research Data Management for Humanities Scholars"
      },
      "year": "2024",
      "duration": { "de": "Laufend", "en": "Ongoing" },
      "role": {
        "de": "Product Design · UX/UI · AI-aided Development · Prototyping",
        "en": "Product Design · UX/UI · AI-aided Development · Prototyping"
      },
      "client": { "de": "Eigenprojekt", "en": "Personal Project" },
      "tags": ["Product Design", "UX/UI", "AI-aided Development", "Prototyping"],
      "wip": true,
      "teaser": {
        "de": "Forschungsdatenmanagement für Geisteswissenschaftler:innen – ein Tool für Historiker:innen, das komplexe Netzwerke aus Personen, Orten, Quellen und Ereignissen strukturiert, ohne technisches Vorwissen vorauszusetzen.",
        "en": "Research data management for humanities scholars — a tool for historians that structures complex networks of people, places, sources and events without requiring technical expertise."
      },
      "sections": [
        {
          "type": "stat_bar",
          "stats": [
            { "value": "1",             "label": { "de": "Produktidee",          "en": "Product Idea" } },
            { "value": "∞",             "label": { "de": "Datenbankiterationen", "en": "Database Iterations" } },
            { "value": "Next.js + MUI", "label": { "de": "Stack",               "en": "Stack" } },
            { "value": "POC",           "label": { "de": "Phase",               "en": "Phase" } }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Historiker:innen arbeiten täglich mit komplexen Netzwerken aus Personen, Orten, Quellen und Ereignissen – aber kaum ein Tool ist für sie gemacht. Die existierenden Lösungen richten sich de facto an IT-Abteilungen: mächtig, aber mit steiler Lernkurve, spezialisiertem Vorwissen und einer Benutzeroberfläche, die Geisteswissenschaftler:innen eher abschreckt als einlädt. Viele kennen diese Tools nicht einmal.",
            "en": "Historians work daily with complex networks of people, places, sources and events — but hardly any tool is built for them. Existing solutions are effectively designed for IT departments: powerful, but steep in learning curve, demanding in prerequisite knowledge, and built around interfaces that intimidate rather than invite. Many humanities scholars aren't even aware these tools exist."
          }
        },
        {
          "type": "insight",
          "content": {
            "de": "„Das Problem ist nicht, dass es keine Lösung gibt. Das Problem ist, dass die Lösungen an der Zielgruppe vorbeientwickelt wurden.\"",
            "en": "\"The problem isn't that there's no solution. The problem is that the solutions were built past their intended audience.\""
          }
        },
        {
          "type": "timeline",
          "phases": [
            {
              "phase": "01",
              "title": { "de": "Problemerkennung", "en": "Problem Discovery" },
              "description": {
                "de": "Im Gespräch mit Historiker:innen kristallisierte sich ein wiederkehrendes Bedürfnis heraus: historische Daten, Orte, Personen, Quellen und Beziehungen strukturiert an einem Ort zusammenführen und auswerten – ohne technisches Vorwissen.",
                "en": "Conversations with historians revealed a recurring need: a single place to bring together and meaningfully analyze historical data, locations, people, sources and relationships — without requiring technical expertise."
              }
            },
            {
              "phase": "02",
              "title": { "de": "Vibe Coding als Designmethode", "en": "Vibe Coding as a Design Method" },
              "description": {
                "de": "Statt Wireframes kam Code. Mit Cursor AI, Next.js und MUI entstanden schnell nutzbare Interfaces – Prototyping nicht als Vorstufe zur Entwicklung, sondern als Designwerkzeug. Was funktioniert, bleibt. Was nicht überzeugt, fliegt raus.",
                "en": "No wireframes, just code. Using Cursor AI, Next.js and MUI, usable interfaces emerged quickly — prototyping not as a precursor to development, but as a design tool in its own right. What works, stays. What doesn't, goes."
              }
            },
            {
              "phase": "03",
              "title": { "de": "Datenbankarchitektur als UX-Problem", "en": "Database Architecture as a UX Problem" },
              "description": {
                "de": "Schnell wurde klar: Informationsarchitektur lässt sich nicht 1:1 in Datenbankstrukturen übersetzen. Eine intensive Lernreise in Datenbankmodellierung folgte – mit dem Ziel, eine Struktur zu schaffen, die maximale Flexibilität und Skalierbarkeit bietet, ohne diese Komplexität an die Nutzer:innen weiterzugeben. Das Datenbankmodell wurde mehrfach grundlegend umgebaut.",
                "en": "It became clear early on that information architecture cannot be translated 1:1 into database structures. An intensive learning journey into data modeling followed — with the goal of building a structure that offers maximum flexibility and scalability without passing that complexity on to users. The data model was rebuilt from the ground up multiple times."
              }
            },
            {
              "phase": "04",
              "title": { "de": "Scope-Erweiterung nach Feedback", "en": "Scope Expansion Through Feedback" },
              "description": {
                "de": "Historiker:innen forschen selten allein. Auf Basis von Nutzerfeedback kamen Projekte mit kollaborativer Bearbeitung hinzu sowie die Anbindung von Bibliographieplattformen zur Referenzierung von Sekundärliteratur.",
                "en": "Historians rarely research alone. Based on user feedback, collaborative projects were added alongside integration with bibliography platforms for referencing secondary literature."
              }
            },
            {
              "phase": "05",
              "title": { "de": "POC-Vorbereitung", "en": "POC Preparation" },
              "description": {
                "de": "Der nächste Schritt: eine breit angelegte Validierung mit einer größeren Gruppe von Wissenschaftler:innen – weniger klassischer Usability Test, mehr Proof of Concept im echten Forschungskontext.",
                "en": "The next step: broader validation with a larger group of researchers — less a classic usability test, more a proof of concept in a real research context."
              }
            }
          ]
        },
        {
          "type": "method_grid",
          "methods": [
            {
              "icon": "ai",
              "title": { "de": "AI-aided Development", "en": "AI-aided Development" },
              "description": {
                "de": "Cursor AI als Denkpartner und Entwicklungswerkzeug – nicht zur Automatisierung, sondern zur Beschleunigung von Lernprozessen und Designentscheidungen.",
                "en": "Cursor AI as a thinking partner and development tool — not for automation, but to accelerate learning processes and design decisions."
              }
            },
            {
              "icon": "database",
              "title": { "de": "Datenbankmodellierung", "en": "Database Modeling" },
              "description": {
                "de": "Iteratives Umbauen der Datenbankstruktur als integraler Teil des UX-Prozesses – weil das Backend die Grenzen des Frontends definiert.",
                "en": "Iteratively rebuilding the database structure as an integral part of the UX process — because the backend defines the limits of the frontend."
              }
            },
            {
              "icon": "code",
              "title": { "de": "Code als Prototyp", "en": "Code as Prototype" },
              "description": {
                "de": "Kein Figma, kein Balsamiq – direkt in produktionsnahem Code prototypen, um echte Interaktion früh erfahrbar zu machen.",
                "en": "No Figma, no Balsamiq — prototyping directly in production-ready code to make real interaction tangible from the start."
              }
            },
            {
              "icon": "research",
              "title": { "de": "Nutzerzentrierte Scope-Entscheidungen", "en": "User-centered Scope Decisions" },
              "description": {
                "de": "Features nicht aus der Idee heraus, sondern aus dem Gespräch mit der Zielgruppe – und den Mut, den Scope zu erweitern wenn das Feedback es verlangt.",
                "en": "Features driven not by ideas, but by conversations with the target audience — and the willingness to expand scope when feedback demands it."
              }
            }
          ]
        },
        {
          "type": "visual_slots",
          "slots": [
            { "id": "dashboard",      "caption": { "de": "Hauptoberfläche / Dashboard",             "en": "Main interface / Dashboard" } },
            { "id": "data-structure", "caption": { "de": "Komplexe Datenstruktur, simpel dargestellt", "en": "Complex data structure, simply presented" } },
            { "id": "collaboration",  "caption": { "de": "Kollaborations- oder Projektansicht",       "en": "Collaboration or project view" } },
            { "id": "behind-scenes",  "caption": { "de": "Ausschnitt Cursor Rules — Behind the Scenes", "en": "Cursor Rules excerpt — Behind the Scenes" } }
          ]
        },
        {
          "type": "key_takeaways",
          "takeaways": [
            {
              "title": { "de": "Prototyping mit Code", "en": "Prototyping with Code" },
              "description": {
                "de": "Der direkteste Weg vom Problem zur überprüfbaren Lösung – wenn man bereit ist, die Lernkurve in Kauf zu nehmen.",
                "en": "The most direct path from problem to testable solution — if you're willing to embrace the learning curve."
              }
            },
            {
              "title": { "de": "Komplexität ist eine UX-Entscheidung", "en": "Complexity is a UX Decision" },
              "description": {
                "de": "Eine mächtige Datenstruktur im Hintergrund zwingt nicht zu einer komplexen Oberfläche im Vordergrund. Das eine zu entwerfen ohne das andere zu kennen, funktioniert nicht.",
                "en": "A powerful data structure in the background doesn't demand a complex interface in the foreground. Designing one without understanding the other doesn't work."
              }
            },
            {
              "title": { "de": "Bedürfnis ≠ Lösung", "en": "Need ≠ Solution" },
              "description": {
                "de": "Ein technisch gedecktes Bedürfnis ist wertlos, wenn die Lösung an den mentalen Modellen und dem Alltag der Zielgruppe vorbeientwickelt wurde.",
                "en": "A technically solved need is worthless if the solution was built past the mental models and daily reality of its users."
              }
            },
            {
              "title": { "de": "Modularität als Überlebensstrategie", "en": "Modularity as a Survival Strategy" },
              "description": {
                "de": "Scope ändert sich. Wer das von Anfang an einplant, überlebt die Änderungen. Wer es nicht tut, baut zweimal.",
                "en": "Scope changes. Building for that from day one means surviving the changes. Not building for it means building twice."
              }
            }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Evidoxa befindet sich in aktiver Entwicklung. Der aktuelle Stand ist ein funktionsfähiger MVP mit Nutzerverwaltung, kollaborativen Projekten, flexiblem Datenmodell und Bibliographieanbindung. Der nächste Schritt ist die Validierung im echten Forschungskontext.",
            "en": "Evidoxa is in active development. The current state is a functional MVP with user management, collaborative projects, a flexible data model and bibliography integration. The next step is validation in a real research context."
          }
        }
      ],
      "assets": []
    }
  ,
    {
      "slug": "sales-lander-optimierung",
      "title": {
        "de": "Conversion Rate Optimierung für internationale Sales Lander",
        "en": "Conversion Rate Optimisation for International Sales Landing Pages"
      },
      "year": "2022",
      "role": {
        "de": "UX Design · Conversion Optimierung · A/B Testing · Analytics",
        "en": "UX Design · Conversion Optimisation · A/B Testing · Analytics"
      },
      "client": {
        "de": "B2C-Unternehmen (vertraulich)",
        "en": "B2C Business (confidential)"
      },
      "tags": ["UX Design", "Conversion Optimisation", "A/B Testing", "Analytics"],
      "confidential": true,
      "teaser": {
        "de": "Eine Bounce Rate von ~90%, eine Conversion Rate unter 1% – und ein datengetriebener Redesign-Prozess, der beides fundamental veränderte. Für ein internationales B2C-Unternehmen.",
        "en": "A bounce rate of ~90%, a conversion rate below 1% – and a data-driven redesign process that fundamentally changed both. For an international B2C business."
      },
      "sections": [
        {
          "type": "stat_bar",
          "stats": [
            { "value": "~90%", "label": { "de": "Bounce Rate (Ausgangslage)", "en": "Bounce Rate (baseline)" } },
            { "value": "150%", "label": { "de": "CR-Steigerung",              "en": "CR increase" } },
            { "value": "+20%", "label": { "de": "CTR",                        "en": "CTR" } },
            { "value": "+8%",  "label": { "de": "Gross Revenue",              "en": "Gross Revenue" } }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Ein internationales B2C-Unternehmen mit hohem Traffic-Volumen verschenkte massiv Potenzial: Bounce Rates um die 90%, eine Conversion Rate unter 1% und Nutzerdaten die zeigten, dass Besucher desorientiert und verwirrt die Seite verließen. Die Aufgabe war klar – aber die Lösung musste mehr leisten als kosmetische Korrekturen.",
            "en": "An international B2C business with high traffic volume was leaving enormous potential on the table: bounce rates around 90%, a conversion rate below 1%, and user data showing visitors leaving the page disoriented and confused. The task was clear — but the solution needed to go beyond cosmetic fixes."
          }
        },
        {
          "type": "insight",
          "content": {
            "de": "„Das Problem war kein schlechtes Produkt. Das Problem war eine Seite, die dem mentalen Modell ihrer Nutzer fundamental widersprach.\"",
            "en": "\"The problem wasn't a bad product. The problem was a page that fundamentally contradicted the mental models of its users.\""
          }
        },
        {
          "type": "timeline",
          "phases": [
            {
              "phase": "01",
              "title": { "de": "Diagnose", "en": "Diagnosis" },
              "description": {
                "de": "Systematische Auswertung von Google Analytics, Hotjar-Heatmaps und internen Controlling-Daten. Wo verlassen Nutzer die Seite? Was übersehen sie? Was verwirrt sie? Aus den Daten entstand ein klares Bild der Schwachstellen.",
                "en": "Systematic analysis of Google Analytics, Hotjar heatmaps and internal controlling data. Where do users leave? What do they miss? What confuses them? A clear picture of the page's weaknesses emerged from the data."
              }
            },
            {
              "phase": "02",
              "title": { "de": "Redesign & Wireframing", "en": "Redesign & Wireframing" },
              "description": {
                "de": "Auf Basis der Analyse entstanden Wireframes einer neu durchdachten Informationsarchitektur: Positionierung und Gewichtung der H1, Struktur der Vorteilsargumentation, Hervorhebung von Benefits und USPs, Platzierung und Gestaltung der CTAs, neues Farbschema das Markenfarben modern positioniert und den Blick aktiv leitet. Das UX-Ziel: Choice Paralysis reduzieren, Vertrauen aufbauen, Emotion wecken – ohne Dark Patterns.",
                "en": "Based on the analysis, wireframes for a rethought information architecture were developed: positioning and weight of the H1, structure of the value proposition, emphasis on benefits and USPs, placement and design of CTAs, a new colour scheme that modernises the brand colours and actively guides the eye. The UX goal: reduce choice paralysis, build trust, evoke emotion — without dark patterns."
              }
            },
            {
              "phase": "03",
              "title": { "de": "Stakeholder-Abstimmung & Handoff", "en": "Stakeholder Alignment & Handoff" },
              "description": {
                "de": "Iterative Abstimmungsrunden mit den Stakeholdern, anschließend pixelgenaues Handoff an die Entwickler: alle relevanten Viewports, Dark- und Light Mode, sämtliche Produktvarianten.",
                "en": "Iterative alignment rounds with stakeholders, followed by pixel-precise handoff to developers: all relevant viewports, dark and light mode, all product variants."
              }
            },
            {
              "phase": "04",
              "title": { "de": "Testing, Messung & Iteration", "en": "Testing, Measurement & Iteration" },
              "description": {
                "de": "Erstausrollung in einem lokalen Markt mit geteiltem Traffic. Nach überzeugenden Ergebnissen breiter Rollout – begleitet von einer systematischen A/B-Test-Serie mit Verify.io: CTA-Farbe, Tone of Voice der Benefits, Position des Language Switch, Einführung eines direkten Sales-Kontakts. Für jeden Test eine Hypothese, statistische Auswertung nach Abschluss, Empfehlung an das Management bei signifikantem p-Wert.",
                "en": "Initial rollout in a local market with split traffic. After convincing results, broader rollout — accompanied by a systematic A/B test series using Verify.io: CTA colour, tone of voice for benefits, position of the language switch, introduction of direct sales contact. A hypothesis for every test, statistical evaluation at completion, recommendation to management when the p-value was significant."
              }
            }
          ]
        },
        {
          "type": "method_grid",
          "methods": [
            {
              "icon": "chart",
              "title": { "de": "Datengetriebene Diagnose", "en": "Data-driven Diagnosis" },
              "description": {
                "de": "Analytics, Heatmaps und Controlling als Grundlage – keine Designentscheidung ohne empirische Basis.",
                "en": "Analytics, heatmaps and controlling as foundation — no design decision without empirical basis."
              }
            },
            {
              "icon": "eye",
              "title": { "de": "Mentale Modelle als Designprinzip", "en": "Mental Models as Design Principle" },
              "description": {
                "de": "Nutzer kommen mit Erwartungen. Die Seite muss diesen Erwartungen begegnen, nicht gegen sie arbeiten.",
                "en": "Users arrive with expectations. The page must meet those expectations, not work against them."
              }
            },
            {
              "icon": "split",
              "title": { "de": "Hypothesenbasiertes A/B Testing", "en": "Hypothesis-based A/B Testing" },
              "description": {
                "de": "Keine Tests ins Blaue – jede Testvariante folgt einer formulierten Hypothese, jedes Ergebnis wird statistisch bewertet.",
                "en": "No testing in the dark — every variant follows a formulated hypothesis, every result is statistically evaluated."
              }
            },
            {
              "icon": "shield",
              "title": { "de": "Überzeugen ohne Dark Patterns", "en": "Persuasion Without Dark Patterns" },
              "description": {
                "de": "Conversion-Optimierung die auf Vertrauen und Klarheit setzt, nicht auf Manipulation – weil das langfristig der einzige skalierbare Ansatz ist.",
                "en": "Conversion optimisation built on trust and clarity, not manipulation — because that's the only approach that scales long-term."
              }
            }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Die Bounce Rate sank signifikant, die Click-Through-Rate stieg um bis zu 20%, die Conversion Rate wuchs von 0,8% auf 2% – eine Steigerung von 150%. Der Gross Revenue legte um 8% zu. Die anschließende A/B-Test-Serie verbesserte einzelne Aspekte weiter und etablierte eine Kultur datenbasierter Designentscheidungen im Team.",
            "en": "The bounce rate dropped significantly, click-through rate increased by up to 20%, conversion rate grew from 0.8% to 2% — a 150% increase. Gross revenue rose by 8%. The subsequent A/B test series further improved individual aspects and established a culture of data-driven design decisions within the team."
          }
        }
      ],
      "assets": []
    }
  ,
    {
      "slug": "paperless-life",
      "title": {
        "de": "Paperless Life — Shopify Store UX, UI & technische Betreuung",
        "en": "Paperless Life — Shopify Store UX, UI & Technical Management"
      },
      "year": "2019–present",
      "role": "UX/UI Design · Shopify Development · E-Commerce · Conversion",
      "client": "Paperless Life",
      "url": "https://paperlesslife.com",
      "tags": ["UX/UI Design", "Shopify", "E-Commerce", "Conversion"],
      "confidential": false,
      "teaser": {
        "de": "Fünf Jahre E-Commerce – von Etsy zu Shopify, durch zwei Major Relaunches, laufende Optimierung und zwei WIP-Projekte. Kein abgeschlossener Case, sondern ein wachsendes System.",
        "en": "Five years of e-commerce – from Etsy to Shopify, through two major relaunches, ongoing optimisation and two WIP projects. Not a closed case study, but a growing system."
      },
      "sections": [
        {
          "type": "stat_bar",
          "stats": [
            { "value": "5+",                                         "label": { "de": "Jahre Betreuung",  "en": "Years" } },
            { "value": "2",                                          "label": { "de": "Major Relaunches", "en": "Major Relaunches" } },
            { "value": "Storefront 2.0",                            "label": { "de": "Shopify",          "en": "Shopify" } },
            { "value": { "de": "Laufend", "en": "Ongoing" },        "label": { "de": "Optimierung",      "en": "Optimisation" } }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Fünf Jahre sind im E-Commerce eine lange Zeit. Paperless Life startete auf Etsy, wuchs in einen eigenen Shopify Store, durchlief einen kompletten Relaunch auf Storefront 2.0 – und entwickelt sich seitdem kontinuierlich weiter. Was dabei entsteht ist kein abgeschlossenes Projekt, sondern ein lebendiges System: immer balancierend zwischen Informationsdichte und Übersichtlichkeit, zwischen Emotion und Conversion, zwischen dem was heute funktioniert und dem was morgen skaliert.",
            "en": "Five years is a long time in e-commerce. Paperless Life started on Etsy, grew into its own Shopify store, went through a complete relaunch on Storefront 2.0 — and has been evolving ever since. What emerges is not a finished project but a living system: constantly balancing information density against clarity, emotion against conversion, what works today against what scales tomorrow."
          }
        },
        {
          "type": "insight",
          "content": {
            "de": "„Ein Store der fünf Jahre überlebt und wächst, braucht kein perfektes Design. Er braucht ein System das mit ihm wächst.\"",
            "en": "\"A store that survives and grows for five years doesn't need perfect design. It needs a system that grows with it.\""
          }
        },
        {
          "type": "timeline",
          "phases": [
            {
              "phase": "2019/2020",
              "title": { "de": "Von Etsy zu Shopify", "en": "From Etsy to Shopify" },
              "description": {
                "de": "Initialer Launch des eigenen Stores nach dem Etsy-Vertrieb. Aufbau der grundlegenden Store-Architektur, Produktseiten-Struktur und ersten Kollektionsseiten.",
                "en": "Initial launch of the standalone store following Etsy distribution. Building the foundational store architecture, product page structure and first collection pages."
              }
            },
            {
              "phase": { "de": "Laufend", "en": "Ongoing" },
              "title": { "de": "Produktseiten-Optimierung", "en": "Product Page Optimisation" },
              "description": {
                "de": "Die Balance zwischen Informationsdichte, Trust-Aufbau, Emotion und Conversion – iterativ verfeinert. Hick's Law als konstantes Designprinzip: jede zusätzliche Option hat ihren Preis.",
                "en": "The balance between information density, trust-building, emotion and conversion — iteratively refined. Hick's Law as a constant design principle: every additional option comes at a cost."
              }
            },
            {
              "phase": { "de": "Laufend", "en": "Ongoing" },
              "title": { "de": "Collection Pages", "en": "Collection Pages" },
              "description": {
                "de": "SEO-Inhalte, Tag-basierte Unternavigation, Integration von Metainformationen wie Sale, Coming Soon oder Ausverkauft – Kollektionsseiten als eigenständige UX-Aufgabe.",
                "en": "SEO content, tag-based sub-navigation, integration of meta-information such as Sale, Coming Soon or Sold Out — collection pages as a UX challenge in their own right."
              }
            },
            {
              "phase": { "de": "Laufend", "en": "Ongoing" },
              "title": { "de": "Differenzierung digitaler und physischer Produkte", "en": "Differentiating Digital and Physical Products" },
              "description": {
                "de": "Unterschiedliche Nutzererwartungen, unterschiedliche Kaufprozesse – Design und Implementierung differenzierter Seiten- und Produktstrukturen sowie Custom Pages für Sonderinhalte wie Baumprojekte und About-Seiten.",
                "en": "Different user expectations, different purchase journeys — design and implementation of differentiated page and product structures, plus custom pages for special content like tree-planting projects and About pages."
              }
            },
            {
              "phase": "Relaunch",
              "title": { "de": "Storefront 2.0 & neues Theme", "en": "Storefront 2.0 & New Theme" },
              "description": {
                "de": "Kompletter Relaunch auf Shopify Storefront 2.0: neues Theme, überarbeitete Architektur, modernisiertes UI.",
                "en": "Complete relaunch on Shopify Storefront 2.0: new theme, revised architecture, modernised UI."
              }
            },
            {
              "phase": "WIP",
              "wip": true,
              "title": { "de": "Produkt-Customizer", "en": "Product Customiser" },
              "description": {
                "de": "Nutzer konfigurieren ihr Produkt Schritt für Schritt, werden visuell geführt, können ihr Ergebnis teilen und direkt bestellen. Die Herausforderungen: Variantendaten jenseits des Shopify-Limits speichern, kognitive Überlastung durch Auswahlvielfalt vermeiden, den richtigen Download-Link nach dem Checkout zum richtigen Kunden bringen.",
                "en": "Users configure their product step by step, guided visually throughout, able to share their result and order directly. The challenges: storing variant data beyond Shopify's limits, avoiding cognitive overload from the breadth of choices, ensuring the right download link reaches the right customer after checkout."
              }
            },
            {
              "phase": "WIP",
              "wip": true,
              "title": { "de": "Navigationsüberarbeitung", "en": "Navigation Overhaul" },
              "description": {
                "de": "Historisch gewachsene, komplexe Navigation – Nutzersignale zeigen Verwirrung. Neuer Ansatz: Differenzierung zwischen produkt- und bedarfsspezifischer Navigation, klares Wording, intuitive Hierarchien, Selbstverortung durch Breadcrumbs.",
                "en": "A historically grown, complex navigation — user signals show confusion. New approach: differentiating between product-specific and needs-based navigation, clear wording, intuitive hierarchies, self-orientation through breadcrumbs and clear structures."
              }
            }
          ]
        },
        {
          "type": "method_grid",
          "methods": [
            {
              "icon": "balance",
              "title": { "de": "Balance als Designprinzip", "en": "Balance as Design Principle" },
              "description": {
                "de": "Informationsdichte vs. Übersichtlichkeit, Emotion vs. Conversion, Heute vs. Skalierbarkeit – E-Commerce-Design ist permanentes Abwägen.",
                "en": "Information density vs. clarity, emotion vs. conversion, today vs. scalability — e-commerce design is permanent negotiation."
              }
            },
            {
              "icon": "layers",
              "title": { "de": "Systeme statt Seiten", "en": "Systems, Not Pages" },
              "description": {
                "de": "Kein einzelnes Feature, sondern eine zusammenhängende Store-Architektur die über Jahre trägt und mit dem Business wächst.",
                "en": "Not individual features, but a coherent store architecture that holds over years and grows with the business."
              }
            },
            {
              "icon": "research",
              "title": { "de": "Nutzersignale als Kompass", "en": "User Signals as Compass" },
              "description": {
                "de": "Heatmaps, Analytics und direkte Nutzerfeedbacks steuern Prioritäten – was optimiert wird, zeigen die Daten.",
                "en": "Heatmaps, analytics and direct user feedback steer priorities — the data shows what gets optimised."
              }
            },
            {
              "icon": "cart",
              "title": { "de": "Shopify als Plattform verstehen", "en": "Understanding Shopify as a Platform" },
              "description": {
                "de": "Technische Grenzen kennen, kreativ umgehen – vom Variantenlimit bis zur Theme-Architektur.",
                "en": "Know the technical limits, work around them creatively — from the variant limit to theme architecture."
              }
            }
          ]
        },
        {
          "type": "visual_slots",
          "slots": [
            { "id": "product-page",    "caption": { "de": "Produktseite — Struktur und Hierarchie",        "en": "Product page — structure and hierarchy" } },
            { "id": "collection-page", "caption": { "de": "Collection Page — Navigation und Metainfos",    "en": "Collection page — navigation and meta information" } },
            { "id": "custom-page",     "caption": { "de": "Custom Page — Baumprojekt oder About",          "en": "Custom page — tree project or About" } },
            { "id": "customiser-wip",  "caption": { "de": "Customizer WIP — aktueller Entwicklungsstand",  "en": "Customiser WIP — current development state" } },
            { "id": "nav-concept",     "caption": { "de": "Navigationskonzept WIP",                        "en": "Navigation concept WIP" } }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Paperless Life ist seit über fünf Jahren ein laufendes Projekt – kein abgeschlossener Case Study, sondern ein Beweis dafür, dass gutes Design nicht einmalig ist. Es ist ein Prozess. Der Store wächst, die Anforderungen wachsen, und das System wächst mit.",
            "en": "Paperless Life has been a running project for over five years — not a closed case study, but proof that good design is never a one-time event. It's a process. The store grows, the requirements grow, and the system grows with them."
          }
        }
      ],
      "assets": []
    }
  ,
    {
      "slug": "design-system-mui-migration",
      "title": {
        "de": "Design System – Von proprietär zu MUI",
        "en": "Design System – From Proprietary to MUI"
      },
      "year": "ongoing",
      "role": "Design Systems · Figma · Component Architecture · Frontend Collaboration",
      "client": {
        "de": "Digital-Produkt-Unternehmen (vertraulich)",
        "en": "Digital Product Company (confidential)"
      },
      "tags": ["Design Systems", "Figma", "Component Architecture", "Frontend Collaboration"],
      "confidential": true,
      "teaser": {
        "de": "Ein proprietäres Design System für mehrere Produkte und fünf Entwickler – und eine Migration zu MUI, die Nutzer und Entwickler kaum bemerkten.",
        "en": "A proprietary design system across multiple products and five developers – and a migration to MUI that users and developers barely noticed."
      },
      "sections": [
        {
          "type": "stat_bar",
          "stats": [
            { "value": "2",  "label": { "de": "Jahre proprietäres System", "en": "Years Proprietary System" } },
            { "value": "5",  "label": { "de": "Frontend-Entwickler",       "en": "Frontend Developers" } },
            { "value": "3+", "label": { "de": "Produkte",                  "en": "Products" } },
            { "value": "1",  "label": { "de": "Designer",                  "en": "Designer" } }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Ein wachsendes Digital-Produkt-Unternehmen, mehrere Produkte in Entwicklung, fünf Frontend-Entwickler – und ein einziger Designer. Die Herausforderung war nicht nur konsistente UIs über Marktplatz, SaaS-Produkt und mehrere Backoffice-Anwendungen hinweg zu gewährleisten, sondern das mit minimalen Reibungsverlusten zwischen Design und Entwicklung zu tun. Die Lösung: ein Design System das von Anfang an so gebaut wurde, dass es mit dem Unternehmen wachsen kann.",
            "en": "A growing digital products company, multiple products in development, five frontend developers — and a single designer. The challenge was not just to ensure consistent UIs across a marketplace, a SaaS product and several backoffice applications, but to do so with minimal friction between design and development. The solution: a design system built from the start to grow with the company."
          }
        },
        {
          "type": "insight",
          "content": {
            "de": "„Ein gutes Design System fällt nicht auf – weder den Nutzern, noch wenn man es migriert.\"",
            "en": "\"A good design system goes unnoticed — by users, and even when you migrate it.\""
          }
        },
        {
          "type": "timeline",
          "phases": [
            {
              "phase": "01",
              "title": { "de": "Aufbau des proprietären Systems", "en": "Building the Proprietary System" },
              "description": {
                "de": "Von Null: Komponentenarchitektur, Button-Varianten, Dark- und Light Mode, Formularelemente, Alerts, Modals – konzipiert, designed und in Figma aufgebaut von einer Person. Klare Strukturprinzipien von Anfang an, die später die Migration erst möglich machten.",
                "en": "From scratch: component architecture, button variants, dark and light mode, form elements, alerts, modals — conceived, designed and built in Figma by one person. Clear structural principles from day one, which later made the migration possible in the first place."
              }
            },
            {
              "phase": "02",
              "title": { "de": "Betrieb & Skalierung", "en": "Operation & Scaling" },
              "description": {
                "de": "Zwei Jahre produktiver Betrieb mit zwei Frontend-Entwicklern. Das System wuchs mit den Produkten – neue Komponenten, neue Kontexte, kontinuierliche Pflege der Figma-Bibliothek und Entwickler-Dokumentation.",
                "en": "Two years of productive operation with two frontend developers. The system grew alongside the products — new components, new contexts, continuous maintenance of the Figma library and developer documentation."
              }
            },
            {
              "phase": "03",
              "title": { "de": "Migration zu MUI", "en": "Migration to MUI" },
              "description": {
                "de": "Die strategische Entscheidung: Entwicklerkapazitäten schonen durch Umstieg auf MUI als technische Basis. Dank der strukturellen Qualität des proprietären Systems verlief die Migration reibungslos – ein minimal customiztes MUI-Theme mit angepasstem Farbschema reichte für einen optisch nahtlosen Go-live. Nutzer und Entwickler merkten kaum einen Unterschied.",
                "en": "The strategic decision: reduce developer overhead by switching to MUI as the technical foundation. Thanks to the structural quality of the proprietary system, the migration was smooth — a minimally customised MUI theme with an adjusted colour scheme was enough for a visually seamless go-live. Users and developers barely noticed the difference."
              }
            },
            {
              "phase": "04",
              "title": { "de": "Parallelbetrieb & laufender Betrieb", "en": "Parallel Operation & Ongoing Management" },
              "description": {
                "de": "Heute laufen beide Systeme parallel – MUI für neue Kontexte, das proprietäre System dort wo eine Migration business-seitig niedrig priorisiert ist. Fünf Entwickler, drei Produkte, ein Designer.",
                "en": "Today both systems run in parallel — MUI for new contexts, the proprietary system where migration has been deprioritised from a business perspective. Five developers, three products, one designer."
              }
            }
          ]
        },
        {
          "type": "method_grid",
          "methods": [
            {
              "icon": "grid",
              "title": { "de": "Component Architecture", "en": "Component Architecture" },
              "description": {
                "de": "Klare, konsistente Komponentenstruktur als Fundament – nicht als Nachgedanke. Varianten, States, Dark/Light Mode von Anfang an mitgedacht.",
                "en": "A clear, consistent component structure as foundation — not an afterthought. Variants, states, dark and light mode considered from the beginning."
              }
            },
            {
              "icon": "refresh",
              "title": { "de": "Migrationsplanung", "en": "Migration Planning" },
              "description": {
                "de": "Eine Migration ist kein Neustart. Wer sein bestehendes System gut kennt, kann Äquivalenzen zu externen Systemen präzise mappen – und Risiken minimieren.",
                "en": "A migration is not a restart. Knowing your existing system well means you can map equivalences to external systems precisely — and minimise risk."
              }
            },
            {
              "icon": "users",
              "title": { "de": "Design-Developer Collaboration", "en": "Design-Developer Collaboration" },
              "description": {
                "de": "Ein Design System ist ein Kommunikationswerkzeug. Tokens, Dokumentation und Figma-Struktur so gestalten, dass Entwickler eigenständig und korrekt damit arbeiten können.",
                "en": "A design system is a communication tool. Tokens, documentation and Figma structure designed so developers can work with it independently and correctly."
              }
            },
            {
              "icon": "layers",
              "title": { "de": "Systemdenken über Produktgrenzen", "en": "Systems Thinking Across Product Boundaries" },
              "description": {
                "de": "Marktplatz, SaaS, Backoffice – unterschiedliche Kontexte, ein zusammenhängendes System. Konsistenz als strategische Entscheidung, nicht als ästhetische Präferenz.",
                "en": "Marketplace, SaaS, backoffice — different contexts, one coherent system. Consistency as a strategic decision, not an aesthetic preference."
              }
            }
          ]
        },
        {
          "type": "visual_slots",
          "slots": [
            { "id": "figma-overview",    "caption": { "de": "Figma Komponentenbibliothek – Übersicht",          "en": "Figma component library — overview" } },
            { "id": "component-detail",  "caption": { "de": "Komponenten-Detail — z.B. Button-Varianten",        "en": "Component detail — e.g. button variants" } },
            { "id": "dark-light-mode",   "caption": { "de": "Dark/Light Mode Gegenüberstellung",                 "en": "Dark / light mode comparison" } },
            { "id": "product-interface", "caption": { "de": "Anwendung im Produkt-Interface",                    "en": "System applied in a product interface" } }
          ]
        },
        {
          "type": "text",
          "content": {
            "de": "Das System läuft seit Jahren produktiv – über mehrere Produkte, durch eine technische Migration und mit wachsendem Entwicklerteam. Dass der Umstieg auf MUI optisch kaum auffiel, war kein Zufall: Es war das Ergebnis einer Systemarchitektur, die von Anfang an auf Klarheit, Konsistenz und Übertragbarkeit ausgelegt war.",
            "en": "The system has been running in production for years — across multiple products, through a technical migration and with a growing development team. That the switch to MUI went visually unnoticed was no coincidence: it was the result of a system architecture designed from the start for clarity, consistency and portability."
          }
        }
      ],
      "assets": []
    }
  ]
}
